Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 7. The method according to claim 5 or 6, wherein the first indication information is carried in user equipment assistance information.
de_de: 7. Verfahren nach Anspruch 5 oder 6, wobei die ersten Angabeinformationen in Benutzergeräte-Hilfeinformationen enthalten sind.

source: 8. The method according to claim 6, wherein a size of the SRS resource corresponding to the antenna switching capability is related to a quantity of SRS resources and a port quantity of the SRS resources.
de_de: 8. Verfahren nach Anspruch 6, wobei eine Größe der SRS-Ressource, die der Antennenumschaltfähigkeit entspricht, eine Anzahl von SRS-Ressourcen und eine Portanzahl der SRS-Ressourcen betrifft.

source: 9. A terminal configured to perform the method according to any of claims 1 to 4.
de_de: 9. Endgerät, das konfiguriert ist, um das Verfahren nach einem der Ansprüche 1 bis 4 durchzuführen.

source: A network device configured to perform the method according to any of claims 5 to 8.
de_de: Netzwerkvorrichtung, die konfiguriert ist, um das Verfahren nach einem der Ansprüche 5 bis 8 durchzuführen.

source: A computer program product, wherein the computer program product comprises computer program code, and when the computer program code is run on a computer, the computer is caused to perform the method according to any of claims 1 to 4.
de_de: Computerprogrammprodukt, wobei das Computerprogrammprodukt Computerprogrammcode umfasst und, wenn der Computerprogrammcode auf einem Computer ausgeführt wird, der Computer dazu veranlasst wird, das Verfahren gemäß einem der Ansprüche 1 bis 4 durchzuführen.

source: A computer program product, wherein the computer program product comprises computer program code, and when the computer program code is run on a computer, the computer is caused to perform the method according to any of claims 5 to 8.
de_de: Computerprogrammprodukt, wobei das Computerprogrammprodukt Computerprogrammcode umfasst und, wenn der Computerprogrammcode auf einem Computer ausgeführt wird, der Computer dazu veranlasst wird, das Verfahren gemäß einem der Ansprüche 5 bis 8 durchzuführen.

source: 1. An information transmission method for a wireless local area network, comprising:
de_de: 1. Informationsübertragungsverfahren für ein drahtloses Netzwerk, umfassend:

source: receiving (810), by a receiving device, a data frame from a sending device, wherein the data frame occupies a transmission resource block, and the data frame comprises resource unit, RU, allocation information;
de_de: Empfangen (810) eines Datenrahmens von einer Sendevorrichtung durch eine Empfangsvorrichtung, wobei der Datenrahmen einen Übertragungsressourcenblock belegt und Zuweisungsinformationen zu Ressourceneinheiten, RU, umfasst;

source: determining (820), by the receiving device, a response resource block based on the transmission resource block and the RU allocation information; and
de_de: Bestimmen (820) eines Antwortressourcenblocks durch die Empfangsvorrichtung basierend auf dem Übertragungsressourcenblock und den RU-Zuweisungsinformationen; und

source: sending (830), by the receiving device, an acknowledgment frame for the data frame to the sending device on the response resource block;
de_de: Senden (830) eines Bestätigungsrahmens für den Datenrahmen durch die Empfangsvorrichtung an die Sendevorrichtung im Antwortressourcenblock;

source: characterized in that determining (820), by the receiving device, a response resource block based on the transmission resource block and the RU allocation information, comprises:
de_de: dadurch gekennzeichnet, dass das Bestimmen (820) eines Antwortressourcenblocks durch die Empfangsvorrichtung basierend auf dem Übertragungsressourcenblock und den RU-Zuweisungsinformationen umfasst:

source: determining, by the receiving device, the response resource block based on indication information and the RU allocation information, wherein the indication information is determined based on a location of a 160 MHz channel with more data tones of the transmission resource block and a resource block size indicated by the RU allocation information, wherein a bandwidth occupied by the transmission resource block is greater than 160 MHz.
de_de: Bestimmen des Antwortressourcenblocks durch die Empfangsvorrichtung basierend auf Indikationsinformationen und den RU-Zuweisungsinformationen, wobei die Indikationsinformationen basierend auf einer Position eines 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks und einer durch die RU-Zuweisungsinformationen angegebenen Ressourcenblockgröße bestimmt werden, wobei eine von dem Übertragungsressourcenblock belegte Bandbreite größer als 160 MHz ist.

source: 2. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a low 160 MHz channel and the resource block size is 2×996+484-tone, a value of the indication information is 0.
de_de: 2. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein niedriger 160-MHz-Kanal ist und die Ressourcenblockgröße 2 × 996 + 484 Töne beträgt, ein Wert der Indikationsinformationen 0 ist.

source: 3. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a high 160 MHz channel and the resource block size is 2×996+484-tone, a value of the indication information is 1.
de_de: 3. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein hoher 160-MHz-Kanal ist und die Ressourcenblockgröße 2 × 996 + 484 Töne beträgt, ein Wert der Indikationsinformationen 1 ist.

source: 4. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a low 160 MHz channel and the resource block size is 3×996-tone or 3×996+484-tone, a value of the indication information is 1.
de_de: 4. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein niedriger 160-MHz-Kanal ist und die Ressourcenblockgröße 3 × 996 Töne oder 3 × 996 - 484 Töne beträgt, ein Wert der Indikationsinformationen 1 ist.

source: 5. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a high 160 MHz channel and the resource block size is 3×996-tone or 3×996+484-tone, a value of the indication information is 0.
de_de: 5. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein hoher 160-MHz-Kanal ist und die Ressourcenblockgröße 3 × 996 Töne oder 3 × 996 + 484 Töne beträgt, ein Wert der Indikationsinformationen 0 ist.

source: 6. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a primary 160 MHz channel and the resource block size is RU or Multi-RU, MRU, less than or equal to 2×996-tone, a value of the indication information is 0.
de_de: 6. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein primärer 160-MHz-Kanal ist und die Größe des Ressourcenblocks RU oder Multi-RU, MRU, weniger als oder gleich 2 × 996 Töne beträgt, ein Wert der Indikationsinformationen 0 ist.

source: 7. The method according to claim 1, wherein when the location of the 160 MHz channel with more data tones of the transmission resource block is a secondary 160 MHz channel and the resource block size is RU or MRU less than or equal to 2×996-tone, a value of the indication information is 1.
de_de: 7. Verfahren nach Anspruch 1, wobei, wenn die Position des 160-MHz-Kanals mit mehr Datentönen des Übertragungsressourcenblocks ein sekundärer 160-MHz-Kanal ist und die Größe des Ressourcenblocks RU oder MRU weniger als oder gleich 2 × 996 Töne beträgt, ein Wert der Indikationsinformationen 1 ist.

source: 8. The method according to claim 1, wherein the data frame comprises triggered response scheduling, TRS, information, the TRS information comprises the RU allocation information.
de_de: 8. Verfahren nach Anspruch 1, wobei der Datenrahmen Informationen zur getriggerten Antwortplanung (TRS) umfasst, wobei die TRS-Informationen die RU-Zuweisungsinformationen umfassen.

source: 9. A computer-readable storage medium, wherein the computer-readable storage medium stores a computer program, and when the computer program is executed by a processor, an apparatus comprising the processor is caused to perform the method in any one of claims 1 to 8.
de_de: 9. Computerlesbares Speichermedium, wobei das computerlesbare Speichermedium ein Computerprogramm speichert, und wenn das Computerprogramm auf einem Prozessor ausgeführt wird, eine den Prozessor umfassende Vorrichtung dazu veranlasst wird, das Verfahren nach einem der Ansprüche 1 bis 8 durchzuführen.

source: An apparatus, comprising:
de_de: Vorrichtung, umfassend:

source: a processor; and
de_de: einen Prozessor; und

source: a memory, storing instructions, which when executed by the processor, cause the apparatus to perform the method in any one of claims 1 to 8.
de_de: einen Speicher, der Anweisungen speichert, die, wenn sie von dem Prozessor ausgeführt werden, bewirken, dass die Vorrichtung das Verfahren nach einem der Ansprüche 1 bis 8 durchführt.

source: 1. A wearable device, comprising:
de_de: 1. Wearable-Vorrichtung, umfassend:

source: a watch body (1), an airbag (2), and an airbag cover (5);
de_de: einen Uhrenkörper (1), ein Luftkissen (2) und eine Luftkissenabdeckung (5);

source: wherein the airbag (2) and the airbag cover (5) are detachably connected with the watch body (1);
de_de: wobei das Luftkissen (2) und die Luftkissenabdeckung (5) lösbar mit dem Uhrenkörper (1) verbunden sind;

source: wherein the air bag (2) comprises:
de_de: wobei das Luftkissen (2) Folgendes umfasst:

source: a first layer structure (203a) and a second layer structure (203b), the first layer structure (203a) has a first cavity, the second layer structure (203b) has a second cavity, and the first cavity is communicated with the second cavity; and
de_de: eine erste Schichtstruktur (203a) und eine zweite Schichtstruktur (203b), wobei die erste Schichtstruktur (203a) einen ersten Hohlraum aufweist, die zweite Schichtstruktur (203b) einen zweiten Hohlraum aufweist, und der erste Hohlraum mit dem zweiten Hohlraum in Verbindung steht; und

source: an air nozzle (201), wherein the air nozzle (201) comprising an air hole connected to the second cavity, the air nozzle (201) is disposed inside the second layer structure (203b);
de_de: eine Luftdüse (201), wobei die Luftdüse (201) ein mit dem zweiten Hohlraum verbundenes Luftloch umfasst, wobei die Luftdüse (201) innerhalb der zweiten Schichtstruktur (203b) angeordnet ist;

source: wherein a support protrusion (2012) is disposed on the air nozzle (201), and the support protrusion is disposed on a peripheral side of the air hole (2013).
de_de: wobei ein Stützvorsprung (2012) an der Luftdüse (201) angeordnet ist, und der Stützvorsprung an einer Umfangsseite des Luftlochs (2013) angeordnet ist,

source: wherein an installation slot (104) is disposed at an end of a bottom surface of the watch body (1), the installation slot (104) comprising an air nozzle installation hole (1023) for insert the air nozzle (201).
de_de: wobei ein Installationsschlitz (104) an einem Ende einer unteren Oberfläche des Uhrenkörpers (1) angeordnet ist, wobei der Installationsschlitz (104) ein Luftdüseninstallationsloch (1023) zum Einsetzen der Luftdüse (201) umfasst.

source: 2. The wearable device according to claim 1, wherein
de_de: 2. Wearable-Vorrichtung nach Anspruch 1, wobei

source: the airbag cover (5) comprises a cover body (501) and a pressing plate (510);
de_de: die Luftkissenabdeckung (5) einen Abdeckungskörper (501) und eine Druckplatte (510) umfasst;

source: the airbag (2) is fixedly connected to the airbag cover (5), and
de_de: das Luftkissen (2) fest mit der Luftkissenabdeckung (5) verbunden ist, und

source: a part that is of the airbag (2) and on which the air nozzle is disposed is located between the pressing plate (510) and the cover body (501).
de_de: ein Teil des Luftkissens (2), auf dem die Luftdüse angeordnet ist, zwischen der Druckplatte (510) und dem Abdeckungskörper (501) angeordnet ist.

source: 3. The wearable device according to claim 2, wherein the pressing plate (510) is fastened to the cover body (501) through bonding, snapping, snap-fitting, threaded connection, welding.
de_de: 3. Wearable-Vorrichtung nach Anspruch 2, wobei die Druckplatte (510) an dem Abdeckungskörper (501) durch Kleben, Schnappen, Einrasten, Verschrauben, Schweißen befestigt ist.

source: 4. The wearable device according to any one of claims 2 to 3, wherein pressing plate (510) comprising an avoidance opening (5051) for the air nozzle (201)to extend out.
de_de: 4. Wearable-Vorrichtung nach einem der Ansprüche 2 bis 3, wobei die Druckplatte (510) eine Ausweichöffnung (5051) umfasst, aus der die Luftdüse (201) herausragen kann.

source: 5. The wearable device according to any one of claims 2 to 4, wherein the airbag cover (5) further comprises an elastic protrusion (511), and the elastic protrusion (511) move in a direction toward or away from the installation slot (104).
de_de: 5. Wearable-Vorrichtung nach einem der Ansprüche 2 bis 4, wobei die Luftkissenabdeckung (5) ferner einen elastischen Vorsprung (511) umfasst und der elastische Vorsprung (511) sich in einer Richtung auf den Installationsschlitz (104) zu oder von ihm weg bewegt.

source: 6. The wearable device according to claim 5, wherein the elastic protrusion (511) comprises a protrusion cover (51101) and an first elastic component (51102),
de_de: 6. Wearable-Vorrichtung nach Anspruch 5, wobei der elastische Vorsprung (511) eine Vorsprungsabdeckung (51101) und eine erste elastische Komponente (51102) umfasst,

source: both the elastic component (51102) and the first protrusion cover (51101) elastically abut against the cover body (501); and
de_de: sowohl die elastische Komponente (51102) als auch die erste Vorsprungsabdeckung (51101) elastisch an dem Abdeckungskörper (501) anliegen; und

source: the pressing plate comprising a protrusion cove hole (5104) for the protrusion cover (51101) to extend out.
de_de: die Druckplatte ein Vorsprungsabdeckungsloch (5104) umfasst, aus dem die Vorsprungsabdeckung (51101) herausragen kann.

source: 7. The wearable device any one of claims 1 to 5,
de_de: 7. Wearable-Vorrichtung nach einem der Ansprüche 1 bis 5,

source: wherein a first flexible inner object is disposed in the first layer structure, and at least a part of the first flexible inner object is fastened to an inner wall of the first layer structure;
de_de: wobei ein erster flexibler innerer Gegenstand in der ersten Schichtstruktur angeordnet ist und mindestens ein Teil des ersten flexiblen inneren Gegenstandes an einer Innenwand der ersten Schichtstruktur befestigt ist;

source: wherein a second flexible inner object is disposed in the second layer structure, and an end of the second flexible inner object is connected to the air nozzle.
de_de: wobei ein zweiter flexibler innerer Gegenstand in der zweiten Schichtstruktur angeordnet ist, und ein Ende des zweiten flexiblen inneren Gegenstandes mit der Luftdüse verbunden ist.

source: 8. The wearable device according to claim 7, wherein,
de_de: 8. Wearable-Vorrichtung nach Anspruch 7, wobei,

source: an extension direction of the first flexible inner object and an extension direction of the first layer structure are same.
de_de: eine Ausdehnungsrichtung des ersten flexiblen inneren Gegenstands und eine Ausdehnungsrichtung der ersten Schichtstruktur gleich sind.

source: 9. The wearable device according to any one of claims 1 to 8, wherein the airbag comprises a connection area (206) connecting the first layer structure (203a) and the second layer structure (203b) and a first through hole is provided in the connection area (206), so that the first cavity communicates with the second cavity.
de_de: 9. Wearable-Vorrichtung nach einem der Ansprüche 1 bis 8, wobei das Luftkissen einen Verbindungsbereich (206) umfasst, der die erste Schichtstruktur (203a) und die zweite Schichtstruktur (203b) verbindet, und in dem Verbindungsbereich (206) ein erstes Durchgangsloch bereitgestellt ist, sodass der erste Hohlraum mit dem zweiten Hohlraum in Verbindung steht.

source: The wearable device according to any one of claims 1 to 9, wherein the wearable device further comprises a protective sleeve (6), and the protective sleeve (6) is sleeved on the first layer structure (203a) of the airbag (2), and is detachably connected to the first layer structure (203a).
de_de: Wearable-Vorrichtung nach einem der Ansprüche 1 bis 9, wobei die tragbare Vorrichtung ferner eine Schutzhülle (6) umfasst und die Schutzhülle (6) über die erste Schichtstruktur (203a) des Luftkissens (2) gestülpt ist und mit der ersten Schichtstruktur (203a) lösbar verbunden ist.

source: The wearable device according to claim 10, wherein the protective sleeve (6) comprises a sleeve body (601) and an edge wrap (602), the sleeve body (601) covers at least a surface that is of the first layer structure (203a) and that is away from the second layer structure (203b), and edge wrap (602) is disposed around an edge of the sleeve body (601).
de_de: Wearable-Vorrichtung nach Anspruch 10, wobei die Schutzhülle (6) einen Hüllenkörper (601) und eine Randumhüllung (602) umfasst, der Hüllenkörper (601) mindestens eine Oberfläche der ersten Schichtstruktur (203a) bedeckt, die von der zweiten Schichtstruktur (203b) entfernt ist, und die Randumhüllung (602) um einen Rand des Hüllenkörpers (601) angeordnet ist.

source: The wearable device according to any one of claims 1 to 11, wherein the airbag cover is provided with a magnet, the watch body is provided with a Hall element, and the magnet and the Hall element are disposed in a fitting manner.
de_de: Wearable-Vorrichtung nach einem der Ansprüche 1 bis 11, wobei die Luftkissenabdeckung mit einem Magneten bereitgestellt ist, der Uhrenkörper mit einem Hall-Element bereitgestellt ist und der Magnet und das Hall-Element in passender Weise angeordnet sind.

source: The wearable device according to any one of claims 1 to 12, wherein the wearable device is a blood pressure measurement watch.
de_de: Wearable-Vorrichtung nach einem der Ansprüche 1 bis 12, wobei die Wearable-Vorrichtung eine Blutdruckmessuhr ist.

source: The wearable device according to any one of claims 1 to 13,
de_de: Wearable-Vorrichtung nach einem der Ansprüche 1 bis 13,

source: wherein a first snap fit is disposed on a first side wall of the installation slot (104), a first bayonet is disposed at a first end part of the airbag cover (5), and the first snap fit can be snap-fitted to the first bayonet;
de_de: wobei ein erster Schnappsitz an einer ersten Seitenwand des Installationsschlitzes (104) angeordnet ist, ein erstes Bajonett an einem ersten Teil der Luftkissenabdeckung (5) angeordnet ist und der erste Schnappsitz mit dem ersten Bajonett verrastet werden kann;

source: wherein a second elastic member, a first accommodating cavity, and a first opening are disposed at a first end of the airbag cover plate, and the second elastic member is located between the first bayonet and the first accommodating cavity, at least a part of the first bayonet extend out of the first accommodating cavity through the first opening.
de_de: wobei ein zweites elastisches Element, ein erster Aufnahmehohlraum und eine erste Öffnung an einem ersten Ende der Luftkissenabdeckplatte angeordnet sind und das zweite elastische Element zwischen dem ersten Bajonett und dem ersten Aufnahmehohlraum angeordnet ist, wobei sich mindestens ein Teil des ersten Bajonetts durch die erste Öffnung aus dem ersten Aufnahmehohlraum heraus erstreckt.

source: The wearable device according to any one of claims 1 to 14,
de_de: Wearable-Vorrichtung nach einem der Ansprüche 1 bis 14,

source: wherein a second bayonet is disposed on a second side wall of the installation slot (104), a second snap fit is disposed at a second end part of the airbag cover (5), and the second snap fit can be snap-fitted to the first bayonet;
de_de: wobei ein zweites Bajonett an einer zweiten Seitenwand des Installationsschlitzes (104) angeordnet ist, ein zweiter Schnappsitz an einem zweiten Teil der Luftkissenabdeckung (5) angeordnet ist, und der zweite Schnappsitz mit dem ersten Bajonett verrastet werden kann;

source: wherein a second accommodating cavity is disposed on the watch body, the installation slot (104) is connected to the second accommodating cavity by using a second through hole, and
de_de: wobei ein zweiter Aufnahmehohlraum auf dem Uhrenkörper angeordnet ist, der Installationsschlitz (104) mit dem zweiten Aufnahmehohlraum unter Verwendung eines zweiten Durchgangslochs verbunden ist, und

source: a third elastic component is disposed between the second snap fit and the second accommodating cavity.
de_de: eine dritte elastische Komponente zwischen dem zweiten Schnappverschluss und dem zweiten Aufnahmehohlraum angeordnet ist.

source: 1. A laser transmit module (1), comprising: a capacitor (10), a laser transmitter (20), and a field effect transistor (30), wherein the capacitor (10) is configured to supply power to the laser transmitter (20); the field effect transistor (30) is configured to control the laser transmitter (20) to be turned on;
de_de: 1. Laserübertragungsmodul (1), umfassend: einen Kondensator (10), einen Lasertransmitter (20) und einen Feldeffekttransistor (30), wobei der Kondensator (10) konfiguriert ist, um den Lasertransmitter (20) mit Strom zu versorgen; der Feldeffekttransistor (30) konfiguriert ist, um das Einschalten des Lasertransmitters (20) zu steuern;

source: the capacitor (10), the laser transmitter (20), and the field effect transistor (30) are interconnected through conductive pins to form a laser transmission loop; and the capacitor (10), the laser transmitter (20), and the field effect transistor (30) are fixedly connected through the interconnected conductive pins;
de_de: der Kondensator (10), der Lasertransmitter (20) und der Feldeffekttransistor (30) über leitfähige Stifte miteinander verbunden sind, um eine Laserübertragungsschleife zu bilden; und der Kondensator (10), der Lasertransmitter (20) und der Feldeffekttransistor (30) über die miteinander verbundenen leitfähigen Stifte fixiert miteinander verbunden sind;

source: wherein the capacitor (10), the laser transmitter (20), and the field effect transistor (30) are disposed in a stacked manner, and characterized in that the laser transmitter (20) is located between the capacitor (10) and the field effect transistor (30).
de_de: wobei der Kondensator (10), der Lasertransmitter (20) und der Feldeffekttransistor (30) gestapelt angeordnet sind, und dadurch gekennzeichnet sind, dass sich der Lasertransmitter (20) zwischen dem Kondensator (10) und dem Feldeffekttransistor (30) befindet.

source: 2. The laser transmit module (1) according to claim 1, wherein a first conductive pin (11) and a second conductive pin (12) are disposed on a first surface that is of the capacitor (10) and that faces the field effect transistor (30);
de_de: 2. Laserübertragungsmodul (1) nach Anspruch 1, wobei ein erster leitfähiger Stift (11) und ein zweiter leitfähiger Stift (12) auf einer ersten Oberfläche des Kondensators (10) angeordnet sind, die dem Feldeffekttransistor (30) zugewandt ist;
